app/controllers/employers_controller.rb

SELECT  "employers".* FROM "employers" WHERE "employers"."id" = ?  ORDER BY "employers"."id" ASC LIMIT 1  [["id", 13]]
---
  def show
    @employers=Employer.find(params[:id])

SELECT  "employers".* FROM "employers" WHERE "employers"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_employer
      @employer=Employer.find(params[:id])