app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ?  ORDER BY "students"."id" ASC LIMIT 1  [["id", 4]]
---
  def show
    @student = Student.find(params[:id])

UPDATE "students" SET "street_address" = ?, "city" = ?, "state" = ?, "zip" = ?, "cell_number" = ?, "home_number" = ?, "gpa" = ?, "skill" = ?, "experience" = ?, "major" = ?, "minor" = ?, "grad_year" = ?, "leadership" = ?, "sport" = ?, "updated_at" = ? WHERE "students"."id" = ?
---
  def update
    respond_to do |format|
      if @student.update(student_params)

UPDATE "students" SET "email" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["email", "chudi.iregbulem@trincoll.edu"], ["updated_at", "2015-04-20 01:30:33.944838"], ["id", 6]]
---
  def finish_signup
    current_student.email = current_student.temp_email
    # authorize! :update, @user
    if request.patch? && params[:student] #&& params[:user][:email]
      if current_student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ?  ORDER BY "students"."id" ASC LIMIT 1  [["id", 6]]
---
    def set_student
      @student = Student.find(params[:id])